Repository: MrLoles/FitFinder
Catalog: lib/l10n/app_*.arb
Languages: pl

# language
source: English
pl: Język polski

source: Skip
pl: Pomiń

source: Next
pl: Dalej

source: Done
pl: Zakończ

source: Back
pl: Powrót

# introduction1_1
source: Welcome to the Fit Finder!
pl: Witaj w aplikacji Fit Finder!

# introduction1_2
source: This application is designed to find the right gym for You.
pl: Ta aplikacja została stworzona by pomóc Ci znaleźć odpowiednią siłownię

# introduction2_1
source: Why it was created?
pl: Dlaczego powstała?

# introduction2_2
source: Developed because there was a shortage of mobile applications allowing users to check gym equipment from home.
pl: Ponieważ brak na rynku aplikacji umożliwiającej sprawdzenie wyposażenia siłowni

# introduction3_1
source: Remember!
pl: Pamiętaj!

# introduction3_2
source: That workout plans generated by apps will never replace a personal trainer and are tailored for the average healthy individual.
pl: Że plany treningowe układane przez aplikacje nigdy nie zastąpią trenera personalnego i układane są pod zdrowego przeciętnego człowieka

# startPageSubtitle
source: We'll help you find the best gym for you!
pl: Znajdź dla siebie idealną siłownię!

# emailInput
source: Email
pl: Email/Nazwa użytkownika

# passwordInput
source: Password
pl: Hasło

# btnLogin
source: Login
pl: Zaloguj

source: Forgot password?
pl: Zapomniałeś hasła?

# googleSignUp
source: Sign up with google
pl: Zaloguj się przez google

# noAccount
source: New user?
pl: Nie masz konta?

source: Register now!
pl: Zarejestruj się!

# validation
source: This field is required
pl: To pole jest wymagane!

# dialogBoxTitle
source: Login failed.
pl: Logowanie nieudane.

# dialogBoxInfo
source: Invalid username or password!
pl: Nieprawidłowy login lub hasło!

# registerTitle
source: Registration
pl: Rejestracja

# registerButton
source: Register
pl: Zarejestruj się

# repeatPasswordValidation
source: Passwords do not match
pl: Podane hasła nie są jednakowe

# emailValidation
source: Email is not valid
pl: Wprowadź poprawny adres email

# repeatPasswordInput
source: Repeat password
pl: Powtórz hasło

# dialogTitleSuccessRegistration
source: Successful Registration
pl: Pomyślna rejestracja

# dialogDescriptionpt1SuccessRegistration
source: Your account has been successfully registered.
pl: Twoje konto zostało pomyślnie zarejestrowane.

# dialogDescriptionpt2SuccessRegistration
source: A registration confirmation email has been sent to the provided email address.
pl: Mail potwierdzający rejestrację został wysłany na podany adres email.

# dialogTitleFailRegistration
source: Registration Failed
pl: Rejestracja nieudana

# dialogSubtitleFailRegistration
source: Failed to register. Please try again.
pl: Rejestracja nieudana. Spróbuj ponownie.

# dialogSubtitleFailRegistrationEmail
source: Email is already taken
pl: Ten adres email jest już zajęty.

# dialogRetryFailRegistration
source: Retry
pl: Ponów próbę

# forgotPasswordDescription1
source: Don't remember your password?
pl: Nie pamiętasz hasła?

# forgotPasswordDescription2
source: You can easily recover your password by providing your email address.
pl: Możesz je łatwo odzyskać wpisując poniżej Twój adres email.

# forgotPasswordDescription3
source: A link to recover your password will be sent to the provided email address.
pl: Link do odzyskania hasła zostanie wysłany na podany adres.

# forgotPasswordButtonSend
source: Recover password
pl: Odzyskaj hasło

# forgotPasswordDialogTitleSuccess
source: Success!
pl: Sukces!

# forgotPasswordDialogDescription1Success
source: If the provided address is associated with an account, a link will be sent to it.
pl: Jeżeli podany adres jest przypisany do konta, zostanie na niego wysłany link

# forgotPasswordDialogDescription2Success
source: Please check your mailbox and follow the steps provided in the email to reset your password.
pl: Sprawdź swoją skrzynkę pocztową i postępuj zgodnie z instrukcjami zawartymi w e-mailu, aby zresetować hasło.

# forgotPasswordDialogTitleFailed
source: Oops, something went wrong :(
pl: Ups, coś poszło nie tak :(

# forgotPasswordDialogDescription1Fail
source: There was an error during recovering password
pl: Wystąpił błąd podczas odzyskiwania hasła.

# forgotPasswordDialogDescription2Fail
source: Please, try again later
pl: Proszę, spróbuj ponownie później
